#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`
#### Checkov 🧪`failure`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_app_service.app_service will be created
  + resource "azurerm_app_service" "app_service" {
      + app_service_plan_id               = (known after apply)
      + app_settings                      = (known after apply)
      + client_affinity_enabled           = false
      + client_cert_enabled               = false
      + custom_domain_verification_id     = (known after apply)
      + default_site_hostname             = (known after apply)
      + enabled                           = true
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + location                          = "eastus"
      + name                              = (known after apply)
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = (known after apply)
      + site_credential                   = (known after apply)

      + source_control {
          + branch             = "main"
          + manual_integration = true
          + repo_url           = "https://github.com/ned1313/nodejs-docs-hello-world"
          + rollback_enabled   = (known after apply)
          + use_mercurial      = false
        }
    }

  # azurerm_app_service_plan.app_service will be created
  + resource "azurerm_app_service_plan" "app_service" {
      + id                           = (known after apply)
      + kind                         = "Windows"
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + maximum_number_of_workers    = (known after apply)
      + name                         = (known after apply)
      + resource_group_name          = (known after apply)

      + sku {
          + capacity = 1
          + size     = "S1"
          + tier     = "Free"
        }
    }

  # azurerm_resource_group.app_service will be created
  + resource "azurerm_resource_group" "app_service" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = (known after apply)
    }

  # random_integer.name_suffix will be created
  + resource "random_integer" "name_suffix" {
      + id     = (known after apply)
      + max    = 99999
      + min    = 10000
      + result = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

<details><summary>Show Checkov Results</summary>

### Terraform Scan Results:

```
Passed Checks: 5, Failed Checks: 11, Skipped Checks: 0
```

| Check ID      | Check Name                                                              | Resource                        | Guideline                                                                                                                                                               | File                  |
|---------------|-------------------------------------------------------------------------|---------------------------------|-------------------------------------------------------------------------------------------------------------------------------------------------------------------------|-----------------------|
| CKV_AZURE_14  | Ensure web app redirects all HTTP traffic to HTTPS in Azure App Service | azurerm_app_service.app_service | [Link](https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-networking-policies/bc-azr-networking-5)                                 | /main/main.tf         |
| CKV_AZURE_213 | Ensure that App Service configures health check                         | azurerm_app_service.app_service | [Link](https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-networking-policies/azr-networking-213)                                  | /main/main.tf         |
| CKV_AZURE_206 | Ensure that Storage Accounts use replication                            | azurerm_storage_account.sa      | [Link](https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-general-policies/azr-general-206)                                        | /remote_setup/main.tf |
| CKV_AZURE_190 | Ensure that Storage blobs restrict public access                        | azurerm_storage_account.sa      | [Link](https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-networking-policies/azr-networking-190)                                  | /remote_setup/main.tf |
| CKV_AZURE_244 | Avoid the use of local users for Azure Storage unless necessary         | azurerm_storage_account.sa      | [Link](None)                                                                                                                                                            | /remote_setup/main.tf |
| CKV_AZURE_59  | Ensure that Storage accounts disallow public access                     | azurerm_storage_account.sa      | [Link](https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-networking-policies/ensure-that-storage-accounts-disallow-public-access) | /remote_setup/main.tf |
| CKV2_AZURE_41 | Ensure storage account is configured with SAS expiration policy         | azurerm_storage_account.sa      | [Link](https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-iam-policies/bc-azure-2-41)                                              | /remote_setup/main.tf |
| CKV2_AZURE_40 | Ensure storage account is not configured with Shared Key authorization  | azurerm_storage_account.sa      | [Link](https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-iam-policies/bc-azure-2-40)                                              | /remote_setup/main.tf |
| CKV2_AZURE_38 | Ensure soft-delete is enabled on Azure storage account                  | azurerm_storage_account.sa      | [Link](https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-general-policies/bc-azure-2-38)                                          | /remote_setup/main.tf |
| CKV2_AZURE_33 | Ensure storage account is configured with private endpoint              | azurerm_storage_account.sa      | [Link](https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-general-policies/bc-azure-2-33)                                          | /remote_setup/main.tf |
| CKV2_AZURE_47 | Ensure storage account is configured without blob anonymous access      | azurerm_storage_account.sa      | [Link](https://docs.prismacloud.io/en/enterprise-edition/policy-reference/azure-policies/azure-iam-policies/bc-azure-2-47)                                              | /remote_setup/main.tf |

---

</details>

*Pusher: @EFeit, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*